org/emacs.org
:PROPERTIES:
:ID:       83bdf269-bd9f-4749-9d9a-9948a4669c5e
:END:
# SPDX-FileCopyrightText: 2024 László Vaskó <vlaci@fastmail.com>
#
# SPDX-License-Identifier: EUPL-1.2
#+FILETAGS: :Emacs:
#+title: Emacs

I use Emacs for almost all general computing needs besides web
browsing. I used to maintain its configuration separately from my
machine configurations, but since I am moving to a more literate
approach, it makes sense to move it here.

#+caption: flake.nix:inputs
#+begin_src nix :noweb-ref flake-inputs
emacs-overlay.url = "github:nix-community/emacs-overlay";
#+end_src

Pass-in the input as a named argument to ~outputs~, so that it is available in modules:

#+caption: flake.nix:outputs-args
#+begin_src nix :noweb-ref outputs-args
emacs-overlay
#+end_src

I am wiring up my Emacs distribution using the ~withPackages~ function
described in the Nixpkgs Manual [[https://nixos.org/manual/nixpkgs/stable/#sec-emacs-config][here]]. Currently I am experimenting
retargeting ~user-init-directory~ to this repository, so I don't need
to rebuild ~Emacs~ every time I want to adjust its configuration.

#+begin_src nix :noweb no-export :noweb-ref local-packages
{
  vlaci-emacs =
    let
      inherit (pkgs) lib;
      pwd = builtins.getEnv "PWD";
      initDirectory = "${pwd}/out/emacs.d";
      dicts = with pkgs.hunspellDicts; [
        hu-hu
        en-us-large
      ];
      dictSearchPath = lib.makeSearchPath "share/hunspell" dicts;
      emacs = (emacs-overlay.lib.${pkgs.system}.emacsPackagesFor pkgs.emacs30-pgtk).withPackages (
        epkgs: with epkgs; [
          <<emacs-packages>>
        ]
      );
    in
    assert lib.assertMsg (pwd != "") "Use --impure flag for building";
    emacs.overrideAttrs (super: {
      # instead of relyiong on `package.el` to wire-up autoloads, do it build-time
      deps = super.deps.overrideAttrs (
        dsuper:
        let
          genAutoloadsCommand = ''
            echo "-- Generating autoloads..."
            autoloads=$out/share/emacs/site-lisp/autoloads.el
            for pkg in "''${requires[@]}"; do
              autoload=("$pkg"/share/emacs/site-lisp/*/*/*-autoloads.el)
              if [[ -e "$autoload" ]]; then
                cat "$autoload" >> "$autoloads"
              fi
            done
            echo "(load \"''$autoloads\")" >> "$siteStart"

            # Byte-compiling improves start-up time only slightly, but costs nothing.
            $emacs/bin/emacs --batch -f batch-byte-compile "$autoloads" "$siteStart"

            $emacs/bin/emacs --batch \
              --eval "(add-to-list 'native-comp-eln-load-path \"$out/share/emacs/native-lisp/\")" \
              -f batch-native-compile "$autoloads" "$siteStart"
          '';
        in
        {
          buildCommand = ''
            ${dsuper.buildCommand}
            ${genAutoloadsCommand}
          '';
        }
      );
      buildCommand = ''
        ${super.buildCommand}
        wrapProgram $out/bin/emacs \
          --append-flags "--init-directory ${initDirectory}" \
          --prefix DICPATH : ${lib.escapeShellArg dictSearchPath}
      '';
    });
}
#+end_src

Lets add it to installed packages:

#+begin_src nix :noweb-ref home-manager-modules :prologue "(" :epilogue ")"
{ pkgs, ... }:

{
  home.packages = [ pkgs.vlaci-emacs ];
}
#+end_src

Also, initialize the basics:

#+caption: erly-init.el
#+begin_src emacs-lisp :tangle out/emacs.d/early-init.el :mkdirp yes
;; -*- lexical-binding: t; -*-
(setq package-enable-at-startup nil
      frame-resize-pixelwise t
      frame-inhibit-implied-resize t
      frame-title-format '("%b")
      ring-bell-function 'ignore
      use-dialog-box nil
      use-file-dialog nil
      use-short-answers t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-echo-area-message user-login-name ; read the docstring
      inhibit-startup-buffer-menu t)

;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)

(startup-redirect-eln-cache (expand-file-name "~/.cache/emacs/eln-cache"))
#+end_src

#+caption: init.el
#+begin_src emacs-lisp :noweb no-export :tangle out/emacs.d/init.el :mkdirp yes
;; -*- lexical-binding: t; -*-

;; Use font from Gsettings from /org/gnome/desktop/interface/
;; The keys read are:
;;  - ‘font-name’
;;  - 'monospace-font-name’
(setq font-use-system-font t)
(set-face-attribute 'fixed-pitch nil :height 1.0)
(set-face-attribute 'variable-pitch nil :height 1.0)

(setq use-package-always-defer t)

(use-package emacs
  :config
  (defvar user-cache-directory "~/.cache/emacs/"
  "Location where files created by emacs are placed.")

  (defun vlaci/in-cache-directory (name)
    "Return NAME appended to cache directory"
    (expand-file-name name user-cache-directory))

  (setq custom-file (vlaci/in-cache-directory "custom.el"))
  (load custom-file :no-error-if-file-is-missing)

  (setq auto-save-interval 2400)
  (setq auto-save-timeout 300)
  (setq auto-save-list-file-prefix
        (vlaci/in-cache-directory "auto-save-list/.saves-"))
  (setq backup-directory-alist
        `(("." . ,(vlaci/in-cache-directory "backup")))
        backup-by-copying t
        version-control t
        delete-old-versions t
        kept-new-versions 10
        kept-old-versions 5))

(use-package recentf
  :config
  (setq recentf-save-file (vlaci/in-cache-directory "recentf")
        recentf-max-saved-items 200
        recentf-auto-cleanup 300)
  (define-advice recentf-cleanup (:around (fun) silently)
    (let ((inhibit-message t)
          (message-log-max nil))
      (funcall fun)))
  (recentf-mode 1))

(use-package savehist
  :defer 2
  :hook (after-init . savehist-mode)
  :config
  (setq savehist-file (vlaci/in-cache-directory "savehist"))
  (setq history-length 1000)
  (setq history-delete-duplicates t)
  (setq savehist-save-minibuffer-history t))

<<init-el>>
#+end_src

** My helper package

This contains my to-be compiled code to keep ~init.el~ clean.

#+begin_src nix :noweb no-export :noweb-ref emacs-packages :prologue "(" :epilogue ")"
trivialBuild {
  pname = "vlaci-emacs";
  version = "0.0";
  src = pkgs.writeText "vlaci-emacs.el" ''
    ;; -*- lexical-binding: t; -*-
    <<vlaci-emacs>>
    (provide 'vlaci-emacs)
  '';
}
#+end_src

*** More hooks

#+caption: packages
#+begin_src nix :noweb-ref emacs-packages
on
#+end_src


#+begin_src emacs-lisp :noweb-ref init-el
(use-package on
  :demand t)
#+end_src

*** UI
#+begin_src nix :noweb-ref emacs-packages
edwina
#+end_src

#+begin_src emacs-lisp :noweb-ref init-el
(use-package edwina
  :disabled
  :hook (after-init . edwina-mode)
  :config
  (setq display-buffer-base-action '(display-buffer-below-selected))
  (edwina-setup-dwm-keys))
#+end_src


#+begin_src nix :noweb-ref emacs-packages :prologue "(" :epilogue ")"
sticky-scroll-mode
#+end_src

#+begin_src emacs-lisp :noweb-ref init-el
(use-package sticky-scroll-mode
  :hook prog-mode)
#+end_src

#+begin_src nix :noweb-ref emacs-packages
spacious-padding
ef-themes
doom-modeline
#+end_src

#+begin_src emacs-lisp :noweb-ref init-el
(use-package spacious-padding
  :defer t)

(use-package doom-modeline
  :defer t)

(add-hook 'window-setup-hook
          (defun vlaci--load-theme-h ()
            (setq modus-themes-italic-constructs t
                  modus-themes-bold-constructs t
                  modus-themes-prompts '(background)
                  modus-themes-mixed-fonts nil
                  modus-themes-org-blocks 'gray-background
                  modus-themes-headings '((0 . (2.0))
                                          (1 . (rainbow background overline 1.5))
                                          (2 . (background overline 1.4))
                                          (3 . (background overline 1.3))
                                          (4 . (background overline 1.2))
                                          (5 . (overline 1.2))
                                          (t . (no-bold 1.1)))
                  modus-themes-common-palette-overrides
                  '((builtin magenta)
                    ;;(comment red-faint)
                    (constant magenta-cooler)
                    (docstring magenta-faint)
                    (docmarkup green-faint)
                    (fnname magenta-warmer)
                    (keyword cyan)
                    (preprocessor cyan-cooler)
                    (string red-cooler)
                    (type magenta-cooler)
                    (variable blue-warmer)
                    (rx-construct magenta-warmer)
                    (rx-backslash blue-cooler)))
            (load-theme 'modus-operandi-tinted :no-confirm)
            (spacious-padding-mode)
            (doom-modeline-mode)) -100)
#+end_src

*** Projects

#+begin_src emacs-lisp :noweb-ref init-el
(use-package project
  :init
  (setq project-list-file (vlaci/in-cache-directory "project-list.ed")))
#+end_src

*** Better ~keyboard-quit~
Based on Prot's [[https://protesilaos.com/codelog/2024-11-28-basic-emacs-configuration/#h:1e468b2a-9bee-4571-8454-e3f5462d9321][Basic and capable configuration article]].

#+begin_src emacs-lisp :noweb-ref init-el
(use-package vlaci-emacs
  :bind (([remap keyboard-quit] . vlaci-keyboard-quit-dwim)))
#+end_src

#+begin_src emacs-lisp :noweb-ref vlaci-emacs
;;;###autoload
(defun vlaci-keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when
the minibuffer is open.  Whereas we want it to close the
minibuffer, even without explicitly focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.
- When a minibuffer is open, but not focused, close the minibuffer.
- When the Completions buffer is selected, close it.
- In every other case use the regular `keyboard-quit'."
  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode) ;; Do I need this?
    (delete-completion-window))
   ((> (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))
#+end_src

*** Icons, icons, icons

#+begin_src emacs-lisp :noweb-ref init-el
(use-package nerd-icons
  :ensure t)

(use-package nerd-icons-completion
  :ensure t
  :after marginalia
  :config
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package nerd-icons-corfu
  :ensure t
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

(use-package nerd-icons-dired
  :ensure t
  :hook
  (dired-mode . nerd-icons-dired-mode))
#+end_src

#+begin_src nix :noweb-ref emacs-packages
nerd-icons
nerd-icons-completion
nerd-icons-corfu
nerd-icons-dired
#+end_src

*** Undo
#+caption: packages
#+begin_src nix :noweb-ref emacs-packages
undo-fu
undo-fu-session
#+end_src


#+begin_src emacs-lisp :noweb-ref init-el
(use-package undo-fu
  :defer t)

(use-package undo-fu-session
  :hook (on-first-buffer . global-undo-fu-session-mode)
  :init (setq undo-fu-session-directory (vlaci/in-cache-directory "undo-fu-session")))
#+end_src

*** Evil

#+caption: packages
#+begin_src nix :noweb-ref emacs-packages
evil
evil-collection
devil
#+end_src


#+begin_src emacs-lisp :noweb-ref init-el
(use-package evil
  :hook (after-init . evil-mode)
  :init
  (setq
   ;; Will be handled by evil-collections
   evil-want-keybinding nil
   ;; Make `Y` behave like `D`
   evil-want-Y-yank-to-eol t
   ;; Do not extend visual selection to whole lines for ex commands
   evil-ex-visual-char-range t
   ;; `*` and `#` selects symbols instead of words
   evil-symbol-word-search t
   ;; Only highlight in the current window
   evil-ex-interactive-search-highlight 'selected-window
   ;; Use vim-emulated search implementation
   evil-search-module 'evil-search
   ;; Do not spam with error messages
   evil-kbd-macro-suppress-motion-error t
   evil-undo-system 'undo-fu
   evil-visual-state-cursor 'hollow
   evil-visual-update-x-selection-p nil
   evil-move-cursor-back nil
   evil-move-beyond-eol t)
  :config
  (require 'evil-collection)
    ;;; delay loading evil-collection modules until they are needed
  (dolist (mode evil-collection-mode-list)
    (dolist (req (or (cdr-safe mode) (list mode)))
      (with-eval-after-load req
        (message "Loading evil-collection for mode %s" req)
        (evil-collection-init (list mode)))))

  (evil-collection-init
   '(help
     (buff-menu "buff-menu")
     calc
     image
     elisp-mode
     replace
     (indent "indent")
     (process-menu simple)
     shortdoc
     tabulated-list
     tab-bar)))

(use-package devil
  :after evil
  :commands (devil)
  :init
  (evil-global-set-key 'normal (kbd "SPC") #'devil)
  :config
  (devil-set-key (kbd "SPC")))
#+end_src

