out/emacs.d/init.el
;; -*- lexical-binding: t; -*-

;; Use font from Gsettings from /org/gnome/desktop/interface/
;; The keys read are:
;;  - ‘font-name’
;;  - 'monospace-font-name’
(setq font-use-system-font t)
(set-face-attribute 'fixed-pitch nil :height 1.0)
(set-face-attribute 'variable-pitch nil :height 1.0)

(use-package emacs
  :config
  (defvar user-cache-directory "~/.cache/emacs/"
  "Location where files created by emacs are placed.")

  (defun vlaci-in-cache-directory (name)
    "Return NAME appended to cache directory"
    (expand-file-name name user-cache-directory))

  (setq custom-file (vlaci-in-cache-directory "custom.el"))
  (load custom-file :no-error-if-file-is-missing)

  (setq auto-save-interval 2400)
  (setq auto-save-timeout 300)
  (setq auto-save-list-file-prefix
        (vlaci-in-cache-directory "auto-save-list/.saves-"))
  (setq backup-directory-alist
        `(("." . ,(vlaci-in-cache-directory "backup")))
        backup-by-copying t
        version-control t
        delete-old-versions t
        kept-new-versions 10
        kept-old-versions 5))

(use-package recentf
  :config
  (setq recentf-save-file (vlaci-in-cache-directory "recentf")
        recentf-max-saved-items 200
        recentf-auto-cleanup 300)
  (define-advice recentf-cleanup (:around (fun) silently)
    (let ((inhibit-message t)
          (message-log-max nil))
      (funcall fun)))
  (recentf-mode 1))

(use-package savehist
  :defer 2
  :hook (after-init . savehist-mode)
  :config
  (setq savehist-file (vlaci-in-cache-directory "savehist"))
  (setq history-length 1000)
  (setq history-delete-duplicates t)
  (setq savehist-save-minibuffer-history t))

(use-package vlaci-emacs
  :bind (([remap keyboard-quit] . vlaci-keyboard-quit-dwim)))
(use-package nerd-icons
  :ensure t)

(use-package nerd-icons-completion
  :ensure t
  :after marginalia
  :config
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package nerd-icons-corfu
  :ensure t
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

(use-package nerd-icons-dired
  :ensure t
  :hook
  (dired-mode . nerd-icons-dired-mode))
