org/emacs.org
*** Tree-Sitter
#+begin_src nix :noweb-ref emacs-packages :prologue "(" :epilogue ")"
treesit-grammars.with-grammars (
  grammars:
  with pkgs.lib;
  pipe grammars [
    (filterAttrs (name: _: name != "recurseForDerivations"))
    builtins.attrValues
  ]
)
#+end_src

*** Languages
#+begin_src nix :noweb-ref emacs-packages
nix-ts-mode
pkgs.nil
rust-mode
#+end_src

#+begin_src emacs-lisp :noweb-ref init-el
(use-package nix-ts-mode
  :mode "\\.nix\\'")

(use-package rust-ts-mode
  :mode "\\.rs\\'")

(use-package python-ts-mode
  :mode "\\.py\\'" "\\.pyi\\'")
#+end_src

*** LSP

#+begin_src nix :noweb-ref emacs-packages
lsp-mode
lsp-ui
lsp-pyright
dap-mode
pkgs.basedpyright
#+end_src

#+begin_src emacs-lisp :noweb-ref init-el
(use-package lsp-mode
  :init
  (setq lsp-keymap-prefix "C-c l"
        lsp-completion-provider :none ;; we use Corfu!
        lsp-inlay-hint-enable t
        lsp-session-file (vlaci/in-cache-directory "lsp-session"))
  (defun vlaci/orderless-dispatch-flex-first-h (_pattern index _total)
    (and (eq index 0) 'orderless-flex))
  (defun vlaci/lsp-mode-completion-setup-h ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless))
    (add-hook 'orderless-style-dispatchers #'vlaci/orderless-dispatch-flex-first-h nil 'local)
    (setq-local completion-at-point-functions (list (cape-capf-buster #'lsp-completion-at-point))))
  :hook ((lsp-completion-mode . vlaci/lsp-mode-completion-setup-h)
         (rust-ts-mode . lsp-deferred)))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :init
  (setq lsp-ui-doc-position 'top))

(use-package lsp-pyright
  :hook (python-ts-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp-deferred)))
  :init
  (setq lsp-pyright-langserver-command "basedpyright"))
#+end_src

*** Direnv

#+begin_src nix :noweb-ref emacs-packages
envrc
#+end_src

#+begin_src emacs-lisp :noweb-ref init-el
(use-package envrc
  :hook (on-first-file . envrc-global-mode)
  :init
  (defun vl/direnv-init-global-mode-earlier-h ()
    (let ((fn #'envrc-global-mode-enable-in-buffer))
      (if (not envrc-global-mode)
          (remove-hook 'change-major-mode-after-body-hook fn)
        (remove-hook 'after-change-major-mode-hook fn)
        (add-hook 'change-major-mode-after-body-hook fn 100))))
  (add-hook 'envrc-global-mode-hook #'vl/direnv-init-global-mode-earlier-h)

  (defvar vl/orig-exec-path exec-path)
  (define-advice envrc--update (:around (fn &rest args) vl/envrc--debounce-add-extra-path-a)
    "Update only on non internal envrc related buffers keeping original path entries as well"
    (when (not (string-prefix-p "*envrc" (buffer-name)))
      (apply fn args)
      (setq-local exec-path (append exec-path vl/orig-exec-path)))))
#+end_src
