out/emacs.d/init.el
(use-package nix-ts-mode
  :mode "\\.nix\\'")
